import React from "react";
import { useParams } from "react-router-dom";
import Assets from "../../Assets";
import styles from "./styles.module.scss";
import DRHeader from "../../components/DRHeader";

export default function Essay() {
  let { essayId }: { essayId: string } = useParams();
  let contentText = content();

  return (
    <div className={styles.essay_page_container}>
      <DRHeader />
      <div className={styles.container}>
        <div className={styles.green_box} />
        <div className={styles.content}>{contentText}</div>
        <div className={styles.green_box} />
      </div>
    </div>
  );

  function content() {
    if (essayId === "0") {
      return (
        <div>
          <p className={styles.title_text}>قلب چیست و چگونه کار میکند</p>
          <p className={styles.content_text}>
            قلب (به فارسی: گِش یا دل) نوعی عضو عضلانی در انسان‌ها و دیگر حیوانات
            است که خون را از طریق رگ خونی در دستگاه گردش خون به گردش درمی‌آورد.
            خون اکسیژن و مواد غذایی لازم را برایِ بدن مهیا می‌سازد و همچنین به
            از بین رفتن موادِّ زائد ناشی از متابولیسم (سوخت و ساز بدن) کمک
            می‌کند. قلبِ (دل) انسان به میانگین در هنگام استراحت حدود ۷۰ بار در
            دقیقه می‌تپد. دل انسان بینِ دو شُش در بدن جا دارد و به گونه‌ای قرار
            گرفته‌است که سر آن به سوی چپ و پایین کج است. هر تپش قلب حدودِ هشت
            دهم ثانیه زمان می‌خواهد که این زمان شامل ۰٫۱ ثانیه انقباض دهلیزها،
            ۰٫۳ ثانیه انقباض بطن‌ها و ۰٫۴ ثانیه استراحت قلب می‌باشد. بافت قلب
            نیز هم‌چون دیگر بافت‌های بدن نیاز به تغذیه دارد که تغذیهٔ قلب
            برعهدهٔ عروقِ کرونری (تاجی) است. قلب در فضای میانی میان‌سینه در سینه
            قرار دارد. قلب در لغت به معنی دگرگونی است قلب از لحاظ علمی اندامی
            است که در مرکز قفسهٔ سینه (متمایل به سمت چپ) واقع شده‌است و وزن آن
            حدود ۳۰۰گرم است و خون را پمپاژ می‌کند نام این عضو به علت اینکه باعث
            دگرگونی خون و تبدیل خون کثیف به خون تمیز می‌شود قلب نام‌گذاری
            شده‌است در دگرگون کردن خون، قلب مانند یک تلمبه عمل می‌کند. در پارسی
            سره این بخش دل نام دارد.
          </p>
          <p className={styles.title_text}>کالبدشناسی قلب</p>
          <p className={styles.content_text}>
            در انسان‌ها، پستانداران دیگر و پرندگان قلب به چهار حفره تقسیم
            می‌شود: دهلیز چپ و راست که بالا و بطن چپ و راست که در قسمت پایین
            قرار گرفته‌است. معمولاً دهلیز و بطنِ راست را به نام قلب راستی و
            همتایان چپی آن‌ها را به نام قلب چپی می‌شناسَند. اما در مواردی دیگر،
            قلب ماهی‌ها دو محفظه، یک بطن و یک دهلیز دارد، در حالی که قلبِ
            خزندگان سه محفظه دارَد. در یک قلب سالم به خاطر وجود دریچه‌های قلبی،
            خون از یک سمت وارد قلب می‌شود که این مسئله از جریان برعکس جلوگیری
            می‌کند. قلب در یک کیسه محافظتی قرار گرفته که پیراشامه (پریکارد) نام
            دارد و همچنین شامل مایع است. دیوارهٔ قلب از چهار لایه چسبیده به هم
            تشکیل می‌شود که به ترتیب از بیرون، شاملِ: پیراشامه (پریکارد) برون
            شامهٔ قلب (اِپی کارد)، ماهیچه قلب (میوکارد) و درون‌شامه قلب
            (آندوکارد). این عضوِ مخروطی شکل به‌صورتِ کیسه‌ایی عضلانی تقریباً در
            وسطِ فضای قفسه سینه(مدیاستینوم میانی) کمی متمایل به جلو و طرفِ چپ
            قراردارد و میان ریهٔ چپ و راست و متمایل به ریهٔ چپ است و همین موجب
            شده‌است تا شکل و قرارگیری ریه‌ها با هم متفاوت باشد. از آن‌جا که قلب
            اندامِ بسیار حساسی و حیاتی است توسط قفسهٔ سینه (توراکس) محافظت
            می‌شود. ابعادِ قلب در یک فرد بزرگسال حدودِ ۶x9x۱۲ سانتیمتر و جرم آن
            در آقایان، حدودِ ۳۰۰ و در خانم‌ها، حدودِ ۲۵۰ گرم، یعنی حدود ۰٫۴ درصد
            جرم کل بدن است.
          </p>
          <div className={styles.heart_image}>
            <img src={Assets.Images.essayForHeart} />
          </div>
          <p className={styles.title_text}>بیماری‌های قلبی</p>
          <p className={styles.content_text}>
            بیماری‌های قلب و عروقی (CVD) معمول‌ترین عامل مرگ در جهان در سال ۲۰۰۸
            بودند که باعث ۳۰ درصد از موارد مرگ شدند. از این میزان بیش از سه
            چهارم به خاطر بیماری شریان‌های کرونری و سکته بوده‌است. عوامل خطر
            شامل مواردی همچون: سیگار کشیدن، اضافه وزن داشتن، عدم فعالیت‌های
            ورزشی کافی، کلسترول بالا، فشار خون بالا، نوعی دیابت که به شکلی ضعیف
            کنترل شده و موارد دیگر می‌شود. تشخیص بیماری قلبی عروقی اغلب با شنیدن
            به صدای قلب با گوشی پزشکی، ECG یا با اکوکاردیوگرام صورت می‌گیرد.
            بیماری‌های مرتبط با قلب اصولاً با متخصصین قلب درمان می‌شود، هرچند که
            بسیاری از متخصصین پزشکی دیگر نیز ممکن است در حل این مسئله کمک کنند.
            متخصّصان اعتقاد دارند بیماریِ سرطان صرف نظر از این که فرد مبتلا
            اقدام به درمان دارویی کرده باشد یا خیر، می‌تواند به عضلات قلب آسیب
            برساند. شیمی درمانی به‌طور بالقوه موجب مسمومیت قلب می‌شود و بیماران
            سرطانی را در برابر اختلالات قلبی از جمله ایست قلبی یا ایسکمی میوکارد
            آسیب‌پذیر می‌کند ضمن اینکه رشد خود تومور نیز می‌تواند موجب آسیب بافت
            قلب شود.
          </p>
        </div>
      );
    } else if (essayId === "1") {
      return (
        <div>
          <p className={styles.title_text}>متخصص قلب یا کاردیولوژیست کیست؟</p>
          <p className={styles.content_text}>
            به عبارت ساده تر، متخصص قلب و عروق پزشکانی هستند که با قلب و عروق
            خونی کار می کنند. آنها برای جلوگیری از بیماری های قلب، تشخیص، معالجه
            و درمان می کنند. متخصص قلب و عروق متخصصی است که به عنوان مشاور سایر
            پزشکان عمل می کند. آنها همچنین بیمارانی را ویزیت می کنند که دچار
            مشکلات قلبی هستند. قلب و عروق یک رشته پیچیده است.متخصصین قلب و عروق
            آموزش گسترده ای را دریافت می کنند: چهار سال دانشکده پزشکی، سه سال
            آموزش پزشکی داخلی و سپس سه یا چند سال در آموزش تخصصی قلب و عروق.
            برای درک پیچیدگی های قلب انسان، متخصصین قلب و عروق به مدت ده سال یا
            بیشتر به مطالعه و آموزش می پردازند و با تهدید گسترده بیماری های
            قلبی، آنها به آموزش بیش از گذشته نیاز دارند. بیماری قلبی عامل اصلی
            مرگ و میر در زنان و مردان در ایالات متحده است. از هر چهار مرگ یک
            مورد را می توان به بیماری قلبی نسبت داد. از آنجا که قلب چنین ارگان
            حیاتی است، مراقبت های قلب و عروق یک شاخه مهم پزشکی است.
          </p>
          <p className={styles.title_text}>تخصص قلب</p>
          <p className={styles.content_text}>
            قلب و عروق شاخه‌ای از طب داخلی است. متخصص قلب همان جراح قلب نیست.
            جراح دارای توانایی شکافتن قفسه سینه و انجام جراحی عمل قلب باز را
            دارد. در حالی که توانایی متخصص قلب، در تشخیص و درمان بیماری‌های
            سیستم قلب و عروق است. متخصص قلب خوب، آزمایشات مربوطه را انجام خواهد
            داد و ممکن است برخی از روش‌ها مانند کاتتریزه شدن قلب، آنژیوپلاستی یا
            قرار دادن ضربان ساز را انجام دهد. بیماری‌های قلبی فقط مختص قلب
            هستند. در حالی که بیماری‌های قلبی عروق بر قلب، رگ‌های خونی یا هر دو
            دلالت می‌کند. تخصص قلب با توجه به روش عملکردی به دو گروه عمده تقسیم
            بندی می‌شوند. 1) متخصصین تهاجمی قلب و عروق (جراح قلب و عروق): این
            متخصصین در زمینه انواع جراحی‌ها نظیر: پیوند قلب قرار دادن گیره
            ایمپلنت قرار دادن ضربان ساز یا پیس میکر آنژیوپلاستی و … فعالیت
            دارند. 2) متخصصین غیر تهاجمی قلب و عروق: این متخصصین در زمینه
            پیشگیری، تشخیص و درمان بیماری‌های قلبی فعالیت می‌کنند. وظیفه این
            متخصصین ایجاد تغییر و تحول در زندگی بیماران است. تا با انجام
            آزمایش‌های به موقع و تشخیص درست موجب بازتوانی و درمان بیماری‌های
            قلبی شوند.
          </p>
          <div className={styles.heart_image}>
            <img src={Assets.Images.doctors} />
          </div>
          <p className={styles.title_text}>وظایف متخصص قلب و عروق</p>
          <p className={styles.content_text}>
            همان گونه که می دانید وظیفه یک متخصص قلب و عروق رسیدگی به وضعیت قلب
            و عروقی است که خونرسانی را در بدن انجام می دهند. تعیین هرگونه
            نارسایی در سیستم قلب و عروق، علت بیماری و … در حیطه تخصص دکتر قلب و
            عروق قرار دارد. لازم به ذکر است که پزشک قلب و عروق عمل جراحی را
            انجام نمی دهد بلکه اگر لازم بداند که قلب بیمار تحت جراحی قرار گیرد،
            باید از یک جراح خبره و ماهر در این زمینه کمک بگیرد. مهمترین وظایف یک
            متخصص قلب و عروق عبارت است از: متخصص قلب و عروق در ابتدا باید آزمایش
            های لازم و تست های مربوط به تعیین وضعیت قلب بیمار را انجام دهد و تا
            قلب از این که نتیجه آزمایش ها مشخص نشده است، حدس های ذهنی خود در
            مورد بیماری را بیان نکند تا موجب نگرانی بیمار نشود. استرس می تواند
            وضعیت قلب را بدتر کرده و در نتیجه نتیجه آزمون خطا خواهد داشت. سپس
            پزشک قلب و عروق آزمایشات را بررسی کرده و معاینات فیزیکی را بر روی
            بیمار انجام می دهد. لازم است یک پرونده پزشکی برای بیمار تشکیل شود.
            این پرونده شامل مجموعه آزمایش ها و تست های انجام شده، نتیجه معاینات
            فیزیکی، روش درمان، دوره درمانی، وضعیت بیمار تا شرایط فعلی و … خواهد
            بود. علت نیاز به پرونده پزشکی این است که اگر بیمار در حین درمان
            تصمیم گرفت که به متخصص قلب و عروق دیگر مراجعه کند و یا اگر پزشک قلب
            و عروق لازم دانست که در حین درمان، از متخصصین دیگر هم کمک بگیرد، این
            پرونده پزشکی می تواند گزارش کاملی از وضعیت بیمار را ارائه کند. ممکن
            است که دکتر قلب و عروق در حین درمان تصمیم بگیرد که روش درمانی را
            تغییر دهد. در این صورت بیمار باید تابع نظر وی باشد. عاقلانه ترین کار
            این است که متخصص قلب و عروق قبل از این که یک روش درمانی را آغاز
            نماید، شرایط بیمار و نتایج آزمایشات را به خوبی بررسی کرده و سپس
            تصمیم نهایی را نحوه درمان اتخاذ کند. متخصص قلب و عروق باید تا جایی
            که امکان دارد، درمان دارویی و غیر جراحی را برای بیمار در نظر بگیرد.
            جراحی آخرین گزینه انتخابی است و در زمانی اعمال می شود که روش های
            دیگر بر روی بیمار جواب ندهد. برای مثال ممکن است متخصص قلب و عروق
            تنها به تغییر سبک زندگی و تجویز چند دارو اکتفا کند.
          </p>
        </div>
      );
    } else {
      return (
        <div>
          <p className={styles.title_text}>اثرات ورزش برقلب</p>
          <p className={styles.content_text}>
            اثرات ورزش برقلب :قلب اندام بسیار حساسی است که کارهای مهم و حیاتی را
            انجام می دهد . سلامت قلب ، زندگی انسانها را دوام بخشیده و او را در
            اجرای کارهای روزمره توانمند و شاداب می کند . زندگی های ماشینی امروزه
            ، آلودگی هوا ، کم تحرکی و تغذیه نامناسب ، خطرهای بی شماری برای قلب
            دارند و قربانیان بسیاری را هر روزه نیز گرفته اند . ورزش اگر به
            اندازه ، با برنامه و منظم باشد ، عاملی مهم برای تقویت قلب است. ورزش
            ، قلب را نیز مانند دیگر اعضای بدن نیرومند می کند .
          </p>
          <p className={styles.title_text}>اثرات ورزش بر تقویت قلب و عروق</p>
          <p className={styles.content_text}>
            اثرات ورزش برقلب : ورزش و فعاليتهاي تربيت بدني موجب تقويت عضله قلب
            مي گردد . امروزه فعاليت هاي ورزشي به عنوان اقدامي جهت پيشگيري از
            بروز سكته ها ی قلبي محسوب مي شوند . 1-در اثر ورزش عروق خوني گشاد شده
            و سبب تسريع جريان خون مي گردد 2-ميزان هموگلوبين خون بيشتر شده و
            نتيجه كار انتقال اكسيژن به قسمت هاي مختلف بدن بهتر انجام مي شود .
            3-ورزش مرتب راهي است مناسب جهت پيشگيري از بروز بيماري فشار خون .
            4-ورزش مي تواند ميزان چربي خون را به حد متعادل برساند ، پس به جاي
            خوردن دارو بهتر است ورزش كنيد اثرات ورزش برقلب 5-ميزان كلسترول خون
            در اثر تمرينات ورزشي بحد مطلوبي ميرسد ، خصوصا“ اگر با رژيم غذايي
            همراه باشد 6-براي بيماران ديابتي ، ورزش بسيار مفيد است و قند خون را
            تا حد مطمئن پائين مي آورد . 7-با تقويت عضله قلب تعداد ضربان قلب در
            دقيقه كم شده و قلب با نيروي بيشتري خون را ارسال مي دارد . 8-با
            انقباض عضلات پا در حين ورزش خون راحت تر به قلب باز مي گردد و از بروز
            بيماري واريس در پاها جلوگيري مي نمايد . 9-اشخاصی که ورزش مي كنند در
            صد بيشتري از دستگاه تنفس خود را بكار مي گيرند . 10-افزايش حجم تنفسي
            در طول روز و شب موجب دريافت اكسيژن بيشتر و رساندن آن به اندامهاي بدن
            مي شود . 11-فردی كه قابليت دريافت و مصرف اكسيژن را در حد بالا داشته
            باشد ، زود خسته نمي شود و كارائی بيشتري خواهد داشت 12-افزايش حجم
            تنفسي در افرادي كه ورزش مي كنند موجب كاهش تعداد تنفس آنها در دقيقه
            شده و بر ميزان اكسيژن گيري هر بار تنفس مي افزايد .
          </p>
          <div className={styles.heart_image}>
            <img src={Assets.Images.actHeart} />
          </div>
          <p className={styles.title_text}>ورزش های مخصوص قلب چیست؟</p>
          <p className={styles.content_text}>
            اثرات ورزش برقلب : تمرین های تنفسی ، از انواع ورزش هایی است که هوای
            بیشتری را به ریه های وارد کرده و بهترین تمرین برای تقویت قلب خواهد
            بود. پیاده روی تند ، پرش در جا ، شنا ، دوچرخه سواری ، طناب بازی ، و
            قایقرانی از جمله ورزشهای مخصوص برای تقویت قلب است . قلب سالم و
            متناسب ، خوب کار کرده و می تواند خون را به آرامی در بدن به جریان
            بیاندازد ، چرا که این قلب قوی و پرتوان است ، ولی قلب ضعیف که نارسا و
            مریض است ، عمل به جریان انداختن را ضعیف انجام داده و کم کم تنبل می
            شود. بهترین دارو برای تقویت قلب و کاهش این نارسایی ها ، انجام تمرین
            های ورزشی مناسب است .
          </p>
        </div>
      );
    }
  }
}
